ulvge/IPMB_gd32/bmc_gd32f303/bsp/bsp_adc.h

#ifndef __BSP_ADC_H
#define	__BSP_ADC_H

#include "gd32f20x.h"
#include "systick.h"
#include "stdint.h"
#include "main.h"


#ifdef DEBUG

    #define   ADC_MODULE       ADC1
    #define   ADC_MODULE_CLK   RCU_ADC1
    #define   ADC_GPIO_CLK     RCU_GPIOB
    #define   ADC_GPIO_PORT    GPIOB
    #define   ADC_GPIO_PIN     GPIO_PIN_0 | GPIO_PIN_1

    #define   ADC_GPIO2_CLK     RCU_GPIOA
    #define   ADC_GPIO2_PORT    GPIOA
    #define   ADC_GPIO2_PIN     GPIO_PIN_4

    #define   ADC_CHANNEL_NUM   2 
#else

    #define   ADC_MODULE       ADC2
    #define   ADC_MODULE_CLK   RCU_ADC2
    #define   ADC_GPIO_CLK     RCU_GPIOF
    #define   ADC_GPIO_PORT    GPIOF
    #define   ADC_GPIO_PIN     GPIO_PIN_3 | GPIO_PIN_4 | GPIO_PIN_5 | GPIO_PIN_6 | GPIO_PIN_7 | GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10

    #define   ADC_CHANNEL_NUM   8
#endif



void adc_init(void);

/*get ADC channel value of conversion*/
uint16_t  get_adc_convers_value(uint8_t channel);

/*get ADC channel value of average conversion*/
uint16_t  get_adc_average_convers_value(uint8_t channel,uint8_t times);

#endif /* __BSP_ADC_H */




